ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_sdio_protocol.c
/*
 * Copyright 2019 Cypress Semiconductor Corporation
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 *     http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/** @file
 *  Broadcom WLAN SDIO Protocol interface
 *
 *  Implements the WHD Bus Protocol Interface for SDIO
 *  Provides functions for initialising, de-intitialising 802.11 device,
 *  sending/receiving raw packets etc
 */

#include <stdlib.h>
#include "cyabs_rtos.h"
#include "cyhal_sdio.h"

#include "whd_bus_sdio_protocol.h"
#include "whd_bus.h"
#include "whd_bus_common.h"
#include "whd_chip_reg.h"
#include "whd_chip_constants.h"
#include "whd_int.h"
#include "whd_chip.h"
#include "whd_sdpcm.h"
#include "whd_debug.h"
#include "whd_sdio.h"
#include "whd_buffer_api.h"
#include "whd_resource_if.h"
#include "whd_types_int.h"
#include "whd_bus_types.h"


/******************************************************
*             Constants
******************************************************/
/* function 1 OCP space */
#define SBSDIO_SB_OFT_ADDR_MASK     0x07FFF     /* sb offset addr is <= 15 bits, 32k */
#define SBSDIO_SB_OFT_ADDR_LIMIT    0x08000
#define SBSDIO_SB_ACCESS_2_4B_FLAG  0x08000     /* with b15, maps to 32-bit SB access */

#define F0_WORKING_TIMEOUT_MS (500)
#define F1_AVAIL_TIMEOUT_MS   (500)
#define F2_AVAIL_TIMEOUT_MS   (500)
#define F2_READY_TIMEOUT_MS   (1000)
#define ALP_AVAIL_TIMEOUT_MS  (100)
#define HT_AVAIL_TIMEOUT_MS   (500)
#define ABORT_TIMEOUT_MS      (100)
/* Taken from FALCON_5_90_195_26 dhd/sys/dhd_sdio.c. */
#define SDIO_F2_WATERMARK     (8)

#define INITIAL_READ   4

#define WHD_THREAD_POLL_TIMEOUT      (CY_RTOS_NEVER_TIMEOUT)

#define WHD_THREAD_POKE_TIMEOUT      (100)

#define HOSTINTMASK                 (I_HMB_SW_MASK)


/******************************************************
*             Structures
******************************************************/
struct whd_bus_priv
{
    whd_sdio_config_t sdio_config;
    whd_bus_stats_t whd_bus_stats;
    void *sdio_obj;
    whd_sdio_funcs_t *sdio_ops;

};

/******************************************************
*             Variables
******************************************************/

/******************************************************
*             Static Function Declarations
******************************************************/

static whd_result_t whd_bus_sdio_transfer(whd_driver_t whd_driver, whd_bus_transfer_direction_t direction,
                                          whd_bus_function_t function, uint32_t address, uint16_t data_size,
                                          uint8_t *data, sdio_response_needed_t response_expected);
static whd_result_t whd_bus_sdio_cmd52(whd_driver_t whd_driver, whd_bus_transfer_direction_t direction,
                                       whd_bus_function_t function, uint32_t address, uint8_t value,
                                       sdio_response_needed_t response_expected, uint8_t *response);
static whd_result_t whd_bus_sdio_cmd53(whd_driver_t whd_driver, whd_bus_transfer_direction_t direction,
                                       whd_bus_function_t function, sdio_transfer_mode_t mode, uint32_t address,
                                       uint16_t data_size, uint8_t *data,
                                       sdio_response_needed_t response_expected,
                                       uint32_t *response);
static whd_result_t whd_bus_sdio_abort_read(whd_driver_t whd_driver, whd_bool_t retry);
static whd_result_t whd_bus_sdio_download_firmware(whd_driver_t whd_driver);

static whd_result_t whd_bus_sdio_set_oob_interrupt(whd_driver_t whd_driver, uint8_t gpio_pin_number);

static void whd_bus_sdio_irq_handler(void *handler_arg, cyhal_sdio_irq_event_t event);
static whd_result_t whd_bus_sdio_irq_register(whd_driver_t whd_driver);
static whd_result_t whd_bus_sdio_irq_enable(whd_driver_t whd_driver, whd_bool_t enable);
static whd_result_t whd_bus_sdio_init_oob_intr(whd_driver_t whd_driver);

/******************************************************
*             SDIO Logging
* Enable this section for logging of SDIO transfers
* by changing "if 0" to "if 1"
******************************************************/
#if 0

#define SDIO_LOG_SIZE (110)
#define SDIO_LOG_HEADER_SIZE (0)  /*(0x30) */

typedef struct sdio_log_entry_struct
{
    whd_bus_transfer_direction_t direction;
    whd_bus_function_t function;
    uint32_t address;
    unsigned long time;
    unsigned long length;
#if (SDIO_LOG_HEADER_SIZE != 0)
    unsigned char header[SDIO_LOG_HEADER_SIZE];
#endif /* if ( SDIO_LOG_HEADER_SIZE != 0 ) */
} sdio_log_entry_t;

static int next_sdio_log_pos = 0;
static sdio_log_entry_t sdio_log_data[SDIO_LOG_SIZE];

static void add_log_entry(whd_bus_transfer_direction_t dir, whd_bus_function_t function, uint32_t address,
                          unsigned long length, uint8_t *data)
{
    sdio_log_data[next_sdio_log_pos].direction = dir;
    sdio_log_data[next_sdio_log_pos].function = function;
    sdio_log_data[next_sdio_log_pos].address = address;
    cy_rtos_get_time(&sdio_log_data[next_sdio_log_pos].time);
    sdio_log_data[next_sdio_log_pos].length = length;
#if (SDIO_LOG_HEADER_SIZE != 0)
    memcpy(sdio_log_data[next_sdio_log_pos].header, data,
           (length >= SDIO_LOG_HEADER_SIZE) ? SDIO_LOG_HEADER_SIZE : length);
#else
    UNUSED_PARAMETER(data);
#endif     /* if ( SDIO_LOG_HEADER_SIZE != 0 ) */
    next_sdio_log_pos++;
    if (next_sdio_log_pos >= SDIO_LOG_SIZE)
    {
        next_sdio_log_pos = 0;
    }
}

#else /* #if 0 */
#define add_log_entry(dir, function, address, length, data)
#endif /* #if 0 */

/******************************************************
*             Global Function definitions
******************************************************/

