ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_sdio_protocol.c
    whd_bus_set_flow_control(whd_driver, WHD_FALSE);

    whd_bus_init_backplane_window(whd_driver);

    /* Setup the backplane*/
    loop_count = 0;
    do
    {
        /* Enable function 1 (backplane) */
        CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_IOEN, (uint8_t)1,
                                                  SDIO_FUNC_ENABLE_1) );
        if (loop_count != 0)
        {
            (void)cy_rtos_delay_milliseconds( (uint32_t)1 );    /* Ignore return - nothing can be done if it fails */
        }
        CHECK_RETURN(whd_bus_read_register_value (whd_driver, BUS_FUNCTION, SDIOD_CCCR_IOEN, (uint8_t)1, &byte_data) );
        loop_count++;
        if (loop_count >= (uint32_t)F0_WORKING_TIMEOUT_MS)
        {
            WPRINT_WHD_ERROR( ("Timeout while setting up the backplane, %s failed at %d \n", __func__, __LINE__) );
            return WHD_TIMEOUT;
        }
    } while (byte_data != (uint8_t)SDIO_FUNC_ENABLE_1);

    if (whd_driver->bus_priv->sdio_config.sdio_1bit_mode == WHD_FALSE)
    {
        /* Read the bus width and set to 4 bits */
        CHECK_RETURN(whd_bus_read_register_value (whd_driver, BUS_FUNCTION, SDIOD_CCCR_BICTRL, (uint8_t)1,
                                                  &byte_data) );
        CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_BICTRL, (uint8_t)1,
                                                  (byte_data & (~BUS_SD_DATA_WIDTH_MASK) ) |
                                                  BUS_SD_DATA_WIDTH_4BIT) );
        /* NOTE: We don't need to change our local bus settings since we're not sending any data (only using CMD52)
         * until after we change the bus speed further down */
    }

    /* Set the block size */

    /* Wait till the backplane is ready */
    loop_count = 0;
    while ( ( (result = whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_BLKSIZE_0, (uint8_t)1,
                                                     (uint32_t)SDIO_64B_BLOCK) ) == WHD_SUCCESS ) &&
            ( (result = whd_bus_read_register_value (whd_driver, BUS_FUNCTION, SDIOD_CCCR_BLKSIZE_0, (uint8_t)1,
                                                     &byte_data) ) == WHD_SUCCESS ) &&
            (byte_data != (uint8_t)SDIO_64B_BLOCK) &&
            (loop_count < (uint32_t)F0_WORKING_TIMEOUT_MS) )
    {
        (void)cy_rtos_delay_milliseconds( (uint32_t)1 );    /* Ignore return - nothing can be done if it fails */
        loop_count++;
        if (loop_count >= (uint32_t)F0_WORKING_TIMEOUT_MS)
        {
            /* If the system fails here, check the high frequency crystal is working */
            WPRINT_WHD_ERROR( ("Timeout while setting block size, %s failed at %d \n", __func__, __LINE__) );
            return WHD_TIMEOUT;
        }
    }

    CHECK_RETURN(result);

    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_BLKSIZE_0,   (uint8_t)1,
                                              (uint32_t)SDIO_64B_BLOCK) );
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_F1BLKSIZE_0, (uint8_t)1,
                                              (uint32_t)SDIO_64B_BLOCK) );
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_F2BLKSIZE_0, (uint8_t)1,
                                              (uint32_t)SDIO_64B_BLOCK) );
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_F2BLKSIZE_1, (uint8_t)1,
                                              (uint32_t)0) );                                                                                  /* Function 2 = 64 */

    /* Register interrupt handler*/
    whd_bus_sdio_irq_register(whd_driver);
    /* Enable SDIO IRQ */
    whd_bus_sdio_irq_enable(whd_driver, WHD_TRUE);

    /* Enable/Disable Client interrupts */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_INTEN, (uint8_t)1,
                                              INTR_CTL_MASTER_EN | INTR_CTL_FUNC1_EN | INTR_CTL_FUNC2_EN) );

    if (whd_driver->bus_priv->sdio_config.high_speed_sdio_clock)
    {
        /* This code is required if we want more than 25 MHz clock */
        CHECK_RETURN(whd_bus_read_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_SPEED_CONTROL, 1, &byte_data) );
        if ( (byte_data & 0x1) != 0 )
        {
            CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_SPEED_CONTROL, 1,
                                                      byte_data | SDIO_SPEED_EHS) );
        }
        else
        {
            WPRINT_WHD_ERROR( ("Error reading bus register, %s failed at %d \n", __func__, __LINE__) );
            return WHD_BUS_READ_REGISTER_ERROR;
        }
    }/* HIGH_SPEED_SDIO_CLOCK */



    /* Wait till the backplane is ready */
    loop_count = 0;
    while ( ( (result = whd_bus_read_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_IORDY, (uint8_t)1,
                                                    &byte_data) ) == WHD_SUCCESS ) &&
            ( (byte_data & SDIO_FUNC_READY_1) == 0 ) &&
            (loop_count < (uint32_t)F1_AVAIL_TIMEOUT_MS) )
    {
        (void)cy_rtos_delay_milliseconds( (uint32_t)1 );   /* Ignore return - nothing can be done if it fails */
        loop_count++;
    }
    if (loop_count >= (uint32_t)F1_AVAIL_TIMEOUT_MS)
    {
        WPRINT_WHD_ERROR( ("Timeout while waiting for backplane to be ready\n") );
        return WHD_TIMEOUT;
    }
    CHECK_RETURN(result);

    /* Set the ALP */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)1,
                                              (uint32_t)(SBSDIO_FORCE_HW_CLKREQ_OFF | SBSDIO_ALP_AVAIL_REQ |
                                                         SBSDIO_FORCE_ALP) ) );

    loop_count = 0;
    while ( ( (result = whd_bus_read_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)1,
                                                    &byte_data) ) == WHD_SUCCESS ) &&
            ( (byte_data & SBSDIO_ALP_AVAIL) == 0 ) &&
            (loop_count < (uint32_t)ALP_AVAIL_TIMEOUT_MS) )
    {
        (void)cy_rtos_delay_milliseconds( (uint32_t)1 );   /* Ignore return - nothing can be done if it fails */
        loop_count++;
    }
    if (loop_count >= (uint32_t)ALP_AVAIL_TIMEOUT_MS)
    {
        WPRINT_WHD_ERROR( ("Timeout while waiting for alp clock\n") );
        return WHD_TIMEOUT;
    }
    CHECK_RETURN(result);

    /* Clear request for ALP */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)1, 0) );

    /* Disable the extra SDIO pull-ups */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_PULL_UP, (uint8_t)1, 0) );
    /* Enable F1 and F2 */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_IOEN, (uint8_t)1,
                                              SDIO_FUNC_ENABLE_1 | SDIO_FUNC_ENABLE_2) );

    /* Check for host-wake configuration */
    if (whd_driver->bus_priv->sdio_config.flags & WHD_BUS_SDIO_OOB_INTR)
    {
        /* Setup host-wake signals */
        CHECK_RETURN(whd_bus_sdio_init_oob_intr(whd_driver) );
    }

    /* Enable F2 interrupt only */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_INTEN, (uint8_t)1,
                                              INTR_CTL_MASTER_EN | INTR_CTL_FUNC2_EN) );

    CHECK_RETURN(whd_bus_read_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_IORDY, (uint8_t)1, &byte_data) );

    /* Read the chip id */
    CHECK_RETURN(whd_bus_read_backplane_value(whd_driver, CHIPCOMMON_BASE_ADDRESS, 2, (uint8_t *)&chip_id) );
    whd_chip_set_chip_id(whd_driver, chip_id);

    cy_rtos_get_time(&elapsed_time);
    result = whd_bus_sdio_download_firmware(whd_driver);
    cy_rtos_get_time(&current_time);
    elapsed_time = current_time - elapsed_time;
    CHECK_RETURN(whd_resource_size(whd_driver, WHD_RESOURCE_WLAN_FIRMWARE, &wifi_firmware_image_size) );
    WPRINT_WHD_INFO( ("WLAN FW download size: %" PRIu32 " bytes\n", wifi_firmware_image_size) );
    WPRINT_WHD_INFO( ("WLAN FW download time: %" PRIu32 " ms\n", elapsed_time) );

    if (result != WHD_SUCCESS)
    {
        /*  either an error or user abort */
        WPRINT_WHD_ERROR( ("SDIO firmware download error, %s failed at %d \n", __func__, __LINE__) );
        return result;
    }

    /* Wait for F2 to be ready */
    loop_count = 0;
    while ( ( (result = whd_bus_read_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_IORDY, (uint8_t)1,
                                                    &byte_data) ) == WHD_SUCCESS ) &&
            ( (byte_data & SDIO_FUNC_READY_2) == 0 ) &&
            (loop_count < (uint32_t)F2_READY_TIMEOUT_MS) )
    {
        (void)cy_rtos_delay_milliseconds( (uint32_t)1 );   /* Ignore return - nothing can be done if it fails */
        loop_count++;
    }
    if (loop_count >= (uint32_t)F2_READY_TIMEOUT_MS)
    {
        /* If your system fails here, it could be due to incorrect NVRAM variables.
         * Check which 'wifi_nvram_image.h' file your platform is using, and
         * check that it matches the WLAN device on your platform, including the
         * crystal frequency.
         */
        WPRINT_WHD_ERROR( ("Timeout while waiting for function 2 to be ready\n") );
        /* Reachable after hitting assert */
        return WHD_TIMEOUT;
    }

    CHECK_RETURN(whd_chip_specific_init(whd_driver) );
    CHECK_RETURN(whd_ensure_wlan_bus_is_up(whd_driver) );
    cyhal_sdio_irq_enable(whd_driver->bus_priv->sdio_obj, CYHAL_SDIO_CARD_INTERRUPT, WHD_TRUE);
    UNUSED_PARAMETER(elapsed_time);
    return result;
}

whd_result_t whd_bus_sdio_deinit(whd_driver_t whd_driver)
{
    if (whd_driver->bus_priv->sdio_config.flags & WHD_BUS_SDIO_OOB_INTR)
    {
        const whd_variant_t oob_intr = whd_driver->bus_priv->sdio_config.oob_intr;
        (*whd_driver->bus_priv->sdio_ops->whd_enable_intr)(whd_driver, oob_intr, WHD_FALSE);
    }

    cyhal_sdio_irq_enable(whd_driver->bus_priv->sdio_obj, CYHAL_SDIO_CARD_INTERRUPT, WHD_FALSE);

    CHECK_RETURN(whd_allow_wlan_bus_to_sleep(whd_driver) );

    whd_bus_set_resource_download_halt(whd_driver, WHD_FALSE);

    DELAYED_BUS_RELEASE_SCHEDULE(whd_driver, WHD_FALSE);

    return WHD_SUCCESS;
}

whd_bool_t whd_bus_sdio_wake_interrupt_present(whd_driver_t whd_driver)
{
    uint32_t int_status = 0;

    /* Ensure the wlan backplane bus is up */
    if (WHD_SUCCESS != whd_ensure_wlan_bus_is_up(whd_driver) )
        return WHD_FALSE;

    if (whd_bus_read_backplane_value(whd_driver, (uint32_t)SDIO_INT_STATUS, (uint8_t)4,
                                     (uint8_t *)&int_status) != WHD_SUCCESS)
    {
        WPRINT_WHD_ERROR( ("%s: Error reading interrupt status\n", __FUNCTION__) );
        goto exit;
    }
    if ( (I_HMB_HOST_INT & int_status) != 0 )
    {
        /* Clear any interrupts */
        if (whd_bus_write_backplane_value(whd_driver, (uint32_t)SDIO_INT_STATUS, (uint8_t)4,
                                          I_HMB_HOST_INT) != WHD_SUCCESS)
        {
            WPRINT_WHD_ERROR( ("%s: Error clearing interrupts\n", __FUNCTION__) );
            goto exit;
        }
        if (whd_bus_read_backplane_value(whd_driver, (uint32_t)SDIO_INT_STATUS, (uint8_t)4,
                                         (uint8_t *)&int_status) != WHD_SUCCESS)
        {
            WPRINT_WHD_ERROR( ("%s: Error reading interrupt status\n", __FUNCTION__) );
            goto exit;
        }
        WPRINT_WHD_DEBUG( ("whd_bus_sdio_wake_interrupt_present after clearing int_status  = [%x]\n",
                           (uint8_t)int_status) );
        return WHD_TRUE;
    }
exit:
    return WHD_FALSE;
}

