ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_sdio_protocol.c
uint32_t whd_bus_sdio_packet_available_to_read(whd_driver_t whd_driver)
{
    uint32_t int_status = 0;

    /* Ensure the wlan backplane bus is up */
    CHECK_RETURN(whd_ensure_wlan_bus_is_up(whd_driver) );

    /* Read the IntStatus */
    if (whd_bus_read_backplane_value(whd_driver, (uint32_t)SDIO_INT_STATUS, (uint8_t)4,
                                     (uint8_t *)&int_status) != WHD_SUCCESS)
    {
        WPRINT_WHD_ERROR( ("%s: Error reading interrupt status\n", __FUNCTION__) );
        int_status = 0;
        goto exit;
    }

    if ( (HOSTINTMASK & int_status) != 0 )
    {
        /* Clear any interrupts */
        if (whd_bus_write_backplane_value(whd_driver, (uint32_t)SDIO_INT_STATUS, (uint8_t)4,
                                          int_status & HOSTINTMASK) != WHD_SUCCESS)
        {
            WPRINT_WHD_ERROR( ("%s: Error clearing interrupts\n", __FUNCTION__) );
            int_status = 0;
            goto exit;
        }
    }
exit:
    return ( (int_status) & (FRAME_AVAILABLE_MASK) );
}

/*
 * From internal documentation: hwnbu-twiki/SdioMessageEncapsulation
 * When data is available on the device, the device will issue an interrupt:
 * - the device should signal the interrupt as a hint that one or more data frames may be available on the device for reading
 * - the host may issue reads of the 4 byte length tag at any time -- that is, whether an interupt has been issued or not
 * - if a frame is available, the tag read should return a nonzero length (>= 4) and the host can then read the remainder of the frame by issuing one or more CMD53 reads
 * - if a frame is not available, the 4byte tag read should return zero
 */
whd_result_t whd_bus_sdio_read_frame(whd_driver_t whd_driver, whd_buffer_t *buffer)
{
    uint16_t hwtag[8];
    uint16_t extra_space_required;
    whd_result_t result;

    *buffer = NULL;

    /* Ensure the wlan backplane bus is up */
    CHECK_RETURN(whd_ensure_wlan_bus_is_up(whd_driver) );

    /* Read the frame header and verify validity */
    memset(hwtag, 0, sizeof(hwtag) );

    result = whd_bus_sdio_transfer(whd_driver, BUS_READ, WLAN_FUNCTION, 0, (uint16_t)INITIAL_READ, (uint8_t *)hwtag,
                                   RESPONSE_NEEDED);
    if (result != WHD_SUCCESS)
    {
        (void)whd_bus_sdio_abort_read(whd_driver, WHD_FALSE);    /* ignore return - not much can be done if this fails */
        WPRINT_WHD_ERROR( ("Error during SDIO receive, %s failed at %d \n", __func__, __LINE__) );
        return WHD_SDIO_RX_FAIL;
    }

    if ( ( (hwtag[0] | hwtag[1]) == 0 ) ||
         ( (hwtag[0] ^ hwtag[1]) != (uint16_t)0xFFFF ) )
    {
        return WHD_HWTAG_MISMATCH;
    }

    if ( (hwtag[0] == (uint16_t)12) &&
         (whd_driver->internal_info.whd_wlan_status.state == WLAN_UP) )
    {
        result = whd_bus_sdio_transfer(whd_driver, BUS_READ, WLAN_FUNCTION, 0, (uint16_t)8, (uint8_t *)&hwtag[2],
                                       RESPONSE_NEEDED);
        if (result != WHD_SUCCESS)
        {
            /* ignore return - not much can be done if this fails */
            (void)whd_bus_sdio_abort_read(whd_driver, WHD_FALSE);
            WPRINT_WHD_ERROR( ("Error during SDIO receive, %s failed at %d \n", __func__, __LINE__) );
            return WHD_SDIO_RX_FAIL;
        }
        whd_sdpcm_update_credit(whd_driver, (uint8_t *)hwtag);
        return WHD_SUCCESS;
    }

    /* Calculate the space we need to store entire packet */
    if ( (hwtag[0] > (uint16_t)INITIAL_READ) )
    {
        extra_space_required = (uint16_t)(hwtag[0] - (uint16_t)INITIAL_READ);
    }
    else
    {
        extra_space_required = 0;
    }

    /* Allocate a suitable buffer */
    result = whd_host_buffer_get(whd_driver, buffer, WHD_NETWORK_RX, (unsigned short)( (uint16_t)INITIAL_READ +
                                                                                       extra_space_required +
                                                                                       (uint16_t)sizeof(
                                                                                           whd_buffer_header_t) ),
                                 WHD_FALSE);
    if (result != WHD_SUCCESS)
    {
        /* Read out the first 12 bytes to get the bus credit information, 4 bytes are already read in hwtag */
        whd_assert("Get buffer error",
                   ( (result == WHD_BUFFER_UNAVAILABLE_TEMPORARY) || (result == WHD_BUFFER_UNAVAILABLE_PERMANENT) ) );
        result = whd_bus_sdio_transfer(whd_driver, BUS_READ, WLAN_FUNCTION, 0, (uint16_t)8, (uint8_t *)&hwtag[2],
                                       RESPONSE_NEEDED);
        if (result != WHD_SUCCESS)
        {
            /* ignore return - not much can be done if this fails */
            (void)whd_bus_sdio_abort_read(whd_driver, WHD_FALSE);
            WPRINT_WHD_ERROR( ("Error during SDIO receive, %s failed at %d \n", __func__, __LINE__) );
            return WHD_SDIO_RX_FAIL;
        }
        result = whd_bus_sdio_abort_read(whd_driver, WHD_FALSE);
        whd_assert("Read-abort failed", result == WHD_SUCCESS);
        REFERENCE_DEBUG_ONLY_VARIABLE(result);

        whd_sdpcm_update_credit(whd_driver, (uint8_t *)hwtag);
        WPRINT_WHD_ERROR( ("Failed to allocate a buffer to receive into, %s failed at %d \n", __func__, __LINE__) );
        return WHD_RX_BUFFER_ALLOC_FAIL;
    }

    /* Copy the data already read */
    memcpy(whd_buffer_get_current_piece_data_pointer(whd_driver, *buffer) + sizeof(whd_buffer_header_t), hwtag,
           (size_t)INITIAL_READ);

    /* Read the rest of the data */
    if (extra_space_required > 0)
    {
        result = whd_bus_sdio_transfer(whd_driver, BUS_READ, WLAN_FUNCTION, 0, extra_space_required,
                                       whd_buffer_get_current_piece_data_pointer(whd_driver,
                                                                                 *buffer) + sizeof(whd_buffer_header_t) +
                                       INITIAL_READ, RESPONSE_NEEDED);
        if (result != WHD_SUCCESS)
        {
            (void)whd_bus_sdio_abort_read(whd_driver, WHD_FALSE);    /* ignore return - not much can be done if this fails */
            CHECK_RETURN(whd_buffer_release(whd_driver, *buffer, WHD_NETWORK_RX) );
            WPRINT_WHD_ERROR( ("Error during SDIO receive, %s failed at %d \n", __func__, __LINE__) );
            return WHD_SDIO_RX_FAIL;
        }
    }
    DELAYED_BUS_RELEASE_SCHEDULE(whd_driver, WHD_TRUE);
    return WHD_SUCCESS;
}

/******************************************************
*     Function definitions for Protocol Common
******************************************************/

/* Device register access functions */
whd_result_t whd_bus_sdio_write_backplane_value(whd_driver_t whd_driver, uint32_t address, uint8_t register_length,
                                                uint32_t value)
{
    CHECK_RETURN(whd_bus_set_backplane_window(whd_driver, address) );

    address &= SBSDIO_SB_OFT_ADDR_MASK;

    if (register_length == 4)
        address |= SBSDIO_SB_ACCESS_2_4B_FLAG;

