ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_sdio_protocol.c
static whd_result_t whd_bus_sdio_download_firmware(whd_driver_t whd_driver)
{
    uint8_t csr_val = 0;
    whd_result_t result;
    uint32_t loop_count;
    uint32_t ram_start_address;

    ram_start_address = GET_C_VAR(whd_driver, ATCM_RAM_BASE_ADDRESS);

    if (ram_start_address != 0)
    {
        CHECK_RETURN(whd_reset_core(whd_driver, WLAN_ARM_CORE, SICF_CPUHALT, SICF_CPUHALT) );
    }
    else
    {
        CHECK_RETURN(whd_disable_device_core(whd_driver, WLAN_ARM_CORE, WLAN_CORE_FLAG_NONE) );
        CHECK_RETURN(whd_disable_device_core(whd_driver, SOCRAM_CORE, WLAN_CORE_FLAG_NONE) );
        CHECK_RETURN(whd_reset_device_core(whd_driver, SOCRAM_CORE, WLAN_CORE_FLAG_NONE) );

        CHECK_RETURN(whd_chip_specific_socsram_init(whd_driver) );
    }

#if 0
    /* 43362 specific: Remap JTAG pins to UART output */
    uint32_t data = 0;
    CHECK_RETURN(whd_bus_write_backplane_value(0x18000650, 1, 1) );
    CHECK_RETURN(whd_bus_read_backplane_value(0x18000654, 4, (uint8_t *)&data) );
    data |= (1 << 24);
    CHECK_RETURN(whd_bus_write_backplane_value(0x18000654, 4, data) );
#endif

    result = whd_bus_write_wifi_firmware_image(whd_driver);

    if (result == WHD_UNFINISHED)
    {
        WPRINT_WHD_INFO( ("User aborted fw download\n") );
        /* user aborted */
        return result;
    }
    else if (result != WHD_SUCCESS)
    {
        whd_assert("Failed to load wifi firmware\n", result == WHD_SUCCESS);
        return result;
    }

    CHECK_RETURN(whd_bus_write_wifi_nvram_image(whd_driver) );

    /* Take the ARM core out of reset */
    if (ram_start_address != 0)
    {
        CHECK_RETURN(whd_reset_core(whd_driver, WLAN_ARM_CORE, 0, 0) );
    }
    else
    {
        CHECK_RETURN(whd_reset_device_core(whd_driver, WLAN_ARM_CORE, WLAN_CORE_FLAG_NONE) );

        result = whd_device_core_is_up(whd_driver, WLAN_ARM_CORE);
        if (result != WHD_SUCCESS)
        {
            WPRINT_WHD_ERROR( ("Could not bring ARM core up\n") );
            /* Reachable after hitting assert */
            return result;
        }
    }

    /* Wait until the High Throughput clock is available */
    loop_count = 0;
    while ( ( (result = whd_bus_read_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)1,
                                                    &csr_val) ) == WHD_SUCCESS ) &&
            ( (csr_val & SBSDIO_HT_AVAIL) == 0 ) &&
            (loop_count < (uint32_t)HT_AVAIL_TIMEOUT_MS) )
    {
        (void)cy_rtos_delay_milliseconds( (uint32_t)1 );   /* Ignore return - nothing can be done if it fails */
        loop_count++;
    }
    if (loop_count >= (uint32_t)HT_AVAIL_TIMEOUT_MS)
    {
        /* If your system times out here, it means that the WLAN firmware is not booting.
         * Check that your WLAN chip matches the 'wifi_image.c' being built - in GNU toolchain, $(CHIP)
         * makefile variable must be correct.
         */
        WPRINT_WHD_ERROR( ("Timeout while waiting for high throughput clock\n") );
        /* Reachable after hitting assert */
        return WHD_TIMEOUT;
    }
    if (result != WHD_SUCCESS)
    {
        WPRINT_WHD_ERROR( ("Error while waiting for high throughput clock\n") );
        /* Reachable after hitting assert */
        return result;
    }

    /* Set up the interrupt mask and enable interrupts */
    CHECK_RETURN(whd_bus_write_backplane_value(whd_driver, SDIO_INT_HOST_MASK, (uint8_t)4, HOSTINTMASK) );

    /* Enable F2 interrupts. This wasn't required for 4319 but is for the 43362 */
    CHECK_RETURN(whd_bus_write_backplane_value(whd_driver, SDIO_FUNCTION_INT_MASK, (uint8_t)1,
                                               SDIO_FUNC_MASK_F1 | SDIO_FUNC_MASK_F2) );

    /* Lower F2 Watermark to avoid DMA Hang in F2 when SD Clock is stopped. */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_FUNCTION2_WATERMARK, (uint8_t)1,
                                              (uint32_t)SDIO_F2_WATERMARK) );

    return WHD_SUCCESS;
}

/** Aborts a SDIO read of a packet from the 802.11 device
 *
 * This function is necessary because the only way to obtain the size of the next
 * available received packet is to read the first four bytes of the packet.
 * If the system reads these four bytes, and then fails to allocate the required
 * memory, then this function allows the system to abort the packet read cleanly,
 * and to optionally tell the 802.11 device to keep it allowing reception once
 * memory is available.
 *
 * In order to do this abort, the following actions are performed:
 * - Sets abort bit for Function 2 (WLAN Data) to request stopping transfer
 * - Sets Read Frame Termination bit to flush and reset fifos
 * - If packet is to be kept and resent by 802.11 device, a NAK  is sent
 * - Wait whilst the Fifo is emptied of the packet ( reading during this period would cause all zeros to be read )
 *
 * @param retry : WHD_TRUE if 802.11 device is to keep and resend packet
 *                WHD_FALSE if 802.11 device is to drop packet
 *
 * @return WHD_SUCCESS if successful, otherwise error code
 */
static whd_result_t whd_bus_sdio_abort_read(whd_driver_t whd_driver, whd_bool_t retry)
{
    WHD_BUS_STATS_INCREMENT_VARIABLE(whd_driver->bus_priv, read_aborts);

    /* Abort transfer on WLAN_FUNCTION */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_CCCR_IOABORT, (uint8_t)1,
                                              (uint32_t)WLAN_FUNCTION) );

    /* Send frame terminate */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_FRAME_CONTROL, (uint8_t)1,
                                              SFC_RF_TERM) );

    /* If we want to retry message, send NAK */
    if (retry == WHD_TRUE)
    {
        CHECK_RETURN(whd_bus_write_backplane_value(whd_driver, (uint32_t)SDIO_TO_SB_MAIL_BOX, (uint8_t)1, SMB_NAK) );
    }

    return WHD_SUCCESS;
}

whd_result_t whd_bus_sdio_read_register_value(whd_driver_t whd_driver, whd_bus_function_t function, uint32_t address,
                                              uint8_t value_length, uint8_t *value)
{
    memset(value, 0, (size_t)value_length);
    return whd_bus_sdio_transfer(whd_driver, BUS_READ, function, address, value_length, value, RESPONSE_NEEDED);
}

whd_result_t whd_bus_sdio_poke_wlan(whd_driver_t whd_driver)
{
    /*TODO: change 1<<3 to a register hash define */
    return whd_bus_write_backplane_value(whd_driver, SDIO_TO_SB_MAILBOX, (uint8_t)4, (uint32_t)(1 << 3) );
}

whd_result_t whd_bus_sdio_wakeup(whd_driver_t whd_driver)
{
    return WHD_SUCCESS;
}

whd_result_t whd_bus_sdio_sleep(whd_driver_t whd_driver)
{
    return WHD_SUCCESS;
}

static whd_result_t whd_bus_sdio_set_oob_interrupt(whd_driver_t whd_driver, uint8_t gpio_pin_number)
{
    if (gpio_pin_number != 0)
    {
        /* Redirect to OOB interrupt to GPIO1 */
        CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_GPIO_SELECT, (uint8_t)1,
                                                  (uint32_t)0xF) );
        CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_GPIO_OUTPUT, (uint8_t)1,
                                                  (uint32_t)0x0) );

        /* Enable GPIOx (bit x) */
        CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_GPIO_ENABLE, (uint8_t)1,
                                                  (uint32_t)0x2) );

        /* Set GPIOx (bit x) on Chipcommon GPIO Control register */
        CHECK_RETURN(whd_bus_write_register_value(whd_driver, BACKPLANE_FUNCTION, CHIPCOMMON_GPIO_CONTROL, (uint8_t)4,
                                                  (uint32_t)0x2) );
    }

    return WHD_SUCCESS;
}

void whd_bus_sdio_init_stats(whd_driver_t whd_driver)
{
    memset(&whd_driver->bus_priv->whd_bus_stats, 0, sizeof(whd_bus_stats_t) );
}

whd_result_t whd_bus_sdio_print_stats(whd_driver_t whd_driver, whd_bool_t reset_after_print)
{
    WPRINT_MACRO( ("Bus Stats.. \n"
                   "cmd52:%" PRIu32 ", cmd53_read:%" PRIu32 ", cmd53_write:%" PRIu32 "\n"
                   "cmd52_fail:%" PRIu32 ", cmd53_read_fail:%" PRIu32 ", cmd53_write_fail:%" PRIu32 "\n"
                   "oob_intrs:%" PRIu32 ", sdio_intrs:%" PRIu32 ", error_intrs:%" PRIu32 ", read_aborts:%" PRIu32
                   "\n",
                   whd_driver->bus_priv->whd_bus_stats.cmd52, whd_driver->bus_priv->whd_bus_stats.cmd53_read,
                   whd_driver->bus_priv->whd_bus_stats.cmd53_write,
                   whd_driver->bus_priv->whd_bus_stats.cmd52_fail,
                   whd_driver->bus_priv->whd_bus_stats.cmd53_read_fail,
                   whd_driver->bus_priv->whd_bus_stats.cmd53_write_fail,
                   whd_driver->bus_priv->whd_bus_stats.oob_intrs,
                   whd_driver->bus_priv->whd_bus_stats.sdio_intrs,
                   whd_driver->bus_priv->whd_bus_stats.error_intrs,
                   whd_driver->bus_priv->whd_bus_stats.read_aborts) );

    if (reset_after_print == WHD_TRUE)
    {
        memset(&whd_driver->bus_priv->whd_bus_stats, 0, sizeof(whd_bus_stats_t) );
    }

    return WHD_SUCCESS;
}

