ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_sdio_protocol.c
    if (loop_count >= (uint32_t)F2_READY_TIMEOUT_MS)
    {
        WPRINT_WHD_DEBUG( ("Timeout while waiting for function 2 to be ready\n") );

        if (WHD_TRUE == wake_from_firmware)
        {
            /* If your system fails here, it could be due to incorrect NVRAM variables.
             * Check which 'wifi_nvram_image.h' file your platform is using, and
             * check that it matches the WLAN device on your platform, including the
             * crystal frequency.
             */
            WPRINT_WHD_ERROR( ("F2 failed on wake fr FW\n") );
            /* Reachable after hitting assert */
            return WHD_TIMEOUT;
        }
        /* Else: Ignore this failure if we're doing a reinit due to host wake: Linux DHD also ignores */

    }

    /* Do chip specific init */
    CHECK_RETURN(whd_chip_specific_init(whd_driver) );

    /* Ensure Bus is up */
    CHECK_RETURN(whd_ensure_wlan_bus_is_up(whd_driver) );

    /* Allow bus to go to  sleep */
    CHECK_RETURN(whd_allow_wlan_bus_to_sleep(whd_driver) );

    WPRINT_WHD_INFO( ("whd_bus_reinit Completed \n") );
    return WHD_SUCCESS;
}

uint8_t whd_bus_sdio_backplane_read_padd_size(whd_driver_t whd_driver)
{
    return WHD_BUS_SDIO_BACKPLANE_READ_PADD_SIZE;
}

whd_bool_t whd_bus_sdio_use_status_report_scheme(whd_driver_t whd_driver)
{
    return WHD_FALSE;
}

uint32_t whd_bus_sdio_get_max_transfer_size(whd_driver_t whd_driver)
{
    return WHD_BUS_SDIO_MAX_BACKPLANE_TRANSFER_SIZE;
}

void whd_bus_sdio_irq_handler(void *handler_arg, cyhal_sdio_irq_event_t event)
{
    whd_driver_t whd_driver = (whd_driver_t)handler_arg;

    /* WHD registered only for CY_CYHAL_SDIO_CARD_INTERRUPT */
    if (event != CYHAL_SDIO_CARD_INTERRUPT)
    {
        WPRINT_WHD_ERROR( ("Unexpected interrupt event %d\n", event) );

        return;
    }

    /* call thread notify to wake up WHD thread */
    whd_thread_notify_irq(whd_driver);
}

whd_result_t whd_bus_sdio_irq_register(whd_driver_t whd_driver)
{
    cyhal_sdio_register_irq(whd_driver->bus_priv->sdio_obj, whd_bus_sdio_irq_handler, whd_driver);
    return WHD_SUCCESS;
}

whd_result_t whd_bus_sdio_irq_enable(whd_driver_t whd_driver, whd_bool_t enable)
{
    cyhal_sdio_irq_enable(whd_driver->bus_priv->sdio_obj, CYHAL_SDIO_CARD_INTERRUPT, enable);
    return WHD_SUCCESS;
}

void whd_bus_sdio_oob_intr_asserted(whd_driver_t whd_driver)
{
    WHD_BUS_STATS_INCREMENT_VARIABLE(whd_driver->bus_priv, oob_intrs);

    /* Call thread notify to wake up WHD thread */
    whd_thread_notify_irq(whd_driver);
}

static whd_result_t whd_bus_sdio_init_oob_intr(whd_driver_t whd_driver)
{
    const whd_variant_t oob_intr = whd_driver->bus_priv->sdio_config.oob_intr;
    whd_intr_config_t config;
    uint8_t sepintpol;

    /* Get the host-wake configuration */
    (*whd_driver->bus_priv->sdio_ops->whd_get_intr_config)(whd_driver, oob_intr, &config);

    /* Choose out-of-band interrupt polarity */
    if (config.is_falling_edge == WHD_FALSE)
    {
        sepintpol = SEP_INTR_CTL_POL;
    }
    else
    {
        sepintpol = 0;
    }

    /* Enable out-of-band interrupt */
    CHECK_RETURN(whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SDIOD_SEP_INT_CTL, (uint8_t)1,
                                              SEP_INTR_CTL_MASK | SEP_INTR_CTL_EN | sepintpol) );

    /* XXX Remove this when BSP377 is implemented */
    (*whd_driver->bus_priv->sdio_ops->whd_enable_intr)(whd_driver, oob_intr, WHD_TRUE);

    /* Set OOB interrupt to the correct WLAN GPIO pin (default to GPIO0) */
    if (config.dev_gpio_sel)
        CHECK_RETURN(whd_bus_sdio_set_oob_interrupt(whd_driver, config.dev_gpio_sel) );

    return WHD_SUCCESS;
}

